packages/windmapper/windmapper-2.1.6-cp38-cp38-macosx_13_0_x86_64.whl/windmapper-2.1.6.data/data/share/windninja/ninjafoam/2.2.0/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    north_face
    {
        type            calculated;
        value           uniform 0;
    }
    west_face
    {
        type            calculated;
        value           uniform 0;
    }
    east_face
    {
        type            calculated;
        value           uniform 0;
    }
    south_face
    {
        type            calculated;
        value           uniform 0;
    }
    minZ
    {
        type            nutkAtmRoughWallFunction;
        z0              $z0$;
        value           uniform 0.1;    
    }
    maxZ
    {
        type            calculated;
        value           uniform 0;
    }
}
// ************************************************************************* //
